{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_36798","layers":[{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense73595","trainable":true,"batch_input_shape":[null,12],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense73596","trainable":true}}]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./record4_snake_gen_30_score_37_walls_true(0_39_16)(2021_9_26).weights.bin"],"weights":[{"name":"dense_Dense73595/kernel","shape":[12,20],"dtype":"float32"},{"name":"dense_Dense73595/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense73596/kernel","shape":[20,4],"dtype":"float32"},{"name":"dense_Dense73596/bias","shape":[4],"dtype":"float32"}]}]}