{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_2399","layers":[{"class_name":"Dense","config":{"units":120,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4797","trainable":true,"batch_input_shape":[null,12],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4798","trainable":true}}]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./snake_gen_74_score_59_walls_false.weights.bin"],"weights":[{"name":"dense_Dense4797/kernel","shape":[12,120],"dtype":"float32"},{"name":"dense_Dense4797/bias","shape":[120],"dtype":"float32"},{"name":"dense_Dense4798/kernel","shape":[120,4],"dtype":"float32"},{"name":"dense_Dense4798/bias","shape":[4],"dtype":"float32"}]}]}